In [1]:
import pandas as pd

In [2]:
cities = ['Austin', 'Dallas', 'Austin', 'Dallas'] 
signups = [7, 12, 3, 5] 
visitors = [139, 237, 326, 456] 
weekdays = ['Sun', 'Sun', 'Mon', 'Mon'] 
list_labels = ['city', 'signups', 'visitors', 'weekday'] 
list_cols = [cities, signups, visitors, weekdays]

In [3]:
zipped = list(zip(list_labels, list_cols))

In [5]:
zpd = zip(list_labels, list_cols)

In [6]:
print (zpd)

<zip object at 0x00000187C0ECD948>

In [4]:
print (zipped)

[('city', ['Austin', 'Dallas', 'Austin', 'Dallas']), ('signups', [7, 12, 3, 5]), ('visitors', [139, 237, 326, 456]), ('weekday', ['Sun', 'Sun', 'Mon', 'Mon'])]

In [8]:
data = dict(zipped)

In [9]:
print(data)

{'city': ['Austin', 'Dallas', 'Austin', 'Dallas'], 'signups': [7, 12, 3, 5], 'visitors': [139, 237, 326, 456], 'weekday': ['Sun', 'Sun', 'Mon', 'Mon']}

In [10]:
users = pd.DataFrame(data)

In [11]:
users

     city  signups  visitors weekday
0  Austin        7       139     Sun
1  Dallas       12       237     Sun
2  Austin        3       326     Mon
3  Dallas        5       456     Mon

###  Broadcasting
i.e. we assign (distrubute some value through whole data frame)

In [14]:
users["fees"] = 0 # <=== we broadcast 0 to new users' column "fees"

In [13]:
users

     city  signups  visitors weekday  fees
0  Austin        7       139     Sun     0
1  Dallas       12       237     Sun     0
2  Austin        3       326     Mon     0
3  Dallas        5       456     Mon     0

In [15]:
heights = [ 59.0, 65.2, 62.9, 65.4, 63.7, 65.7, 64.1 ] 
data = {'height': heights, 'sex': 'M'} 
results = pd.DataFrame(data) 
print(results)

   height sex
0    59.0   M
1    65.2   M
2    62.9   M
3    65.4   M
4    63.7   M
5    65.7   M
6    64.1   M

### index and columns' names

In [16]:
results.columns = ['height (in)', 'sex'] 
results.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G'] 
print(results)

   height (in) sex
A         59.0   M
B         65.2   M
C         62.9   M
D         65.4   M
E         63.7   M
F         65.7   M
G         64.1   M